Revit 2018 API
ProjectLocation.SiteLocation Property
The site location to which this project location refers.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 18.0.0.0 (18.0.0.0)
Syntax
C#
[ObsoleteAttribute("This property is deprecated in Revit 2018. Use ProjectLocation.GetSiteLocation() instead.")]
public SiteLocation SiteLocation { get; }
Visual Basic
<ObsoleteAttribute("This property is deprecated in Revit 2018. Use ProjectLocation.GetSiteLocation() instead.")> _
Public ReadOnly Property SiteLocation As SiteLocation
	Get
Visual C++
[ObsoleteAttribute(L"This property is deprecated in Revit 2018. Use ProjectLocation.GetSiteLocation() instead.")]
public:
property SiteLocation^ SiteLocation {
	SiteLocation^ get ();
}
Remarks
The site location object contains the longitude, latitude and time-zone of the entire project site.
See Also
ProjectLocation Class
Autodesk.Revit.DB Namespace